--- a/docs/task-states.md
+++ b/docs/task-states.md
@@ -1,214 +1,232 @@
+a complex task management scheme based on the four phases Planning, Implementation, Approval and
+Integration:
 
 ```mermaid
 stateDiagram-v2
     [*]          --> DRAFTED
-    DRAFTED      --> SHELVED:      shelved
-    SHELVED      --> DRAFTED:      drafted
-    DRAFTED      --> PLANNING:     plan
-    PLANNING     --> DRAFTED:      drafted
-    PLANNING     --> SHELVED:      shelved
+    DRAFTED      --> SHELVED
+    SHELVED      --> DRAFTED
+    DRAFTED      --> PLANNING
+    PLANNING     --> DRAFTED
+    PLANNING     --> SHELVED
 
-    PLANNING     --> PLANNED:      planned
-    PLANNED      --> STALLED:      stalled
-    STALLED      --> PLANNED:      planned
-    PLANNED      --> IMPLEMENTING: implement
-    IMPLEMENTING --> PLANNED:      planned
-    IMPLEMENTING --> STALLED:      stalled
+    PLANNING     --> PLANNED
+    PLANNED      --> STALLED
+    STALLED      --> PLANNED
+    PLANNED      --> IMPLEMENTING
+    IMPLEMENTING --> PLANNED
+    IMPLEMENTING --> STALLED
 
-    IMPLEMENTING --> IMPLEMENTED:  implemented
-    IMPLEMENTED  --> DECLINED:     declined
-    DECLINED     --> IMPLEMENTED:  implemented
-    IMPLEMENTED  --> APPROVING:    approve
-    APPROVING    --> IMPLEMENTED:  implemented
-    APPROVING    --> DECLINED:     declined
+    IMPLEMENTING --> IMPLEMENTED
+    IMPLEMENTED  --> DECLINED
+    DECLINED     --> IMPLEMENTED
+    IMPLEMENTED  --> APPROVING
+    APPROVING    --> IMPLEMENTED
+    APPROVING    --> DECLINED
 
-    APPROVING    --> APPROVED:     approved
-    APPROVED     --> DEFERRED:     deferred
-    DEFERRED     --> APPROVED:     approved
-    APPROVED     --> INTEGRATING:  integrate
-    INTEGRATING  --> APPROVED:     approved
-    INTEGRATING  --> DEFERRED:     deferred
+    APPROVING    --> APPROVED
+    APPROVED     --> DEFERRED
+    DEFERRED     --> APPROVED
+    APPROVED     --> INTEGRATING
+    INTEGRATING  --> APPROVED
+    INTEGRATING  --> DEFERRED
 
-    INTEGRATING  --> INTEGRATED:   integrated
+    INTEGRATING  --> INTEGRATED
 
-    IMPLEMENTING --> DRAFTED:      drafted
-    APPROVING    --> DRAFTED:      drafted
-    APPROVING    --> PLANNED:      planned
-    INTEGRATING  --> DRAFTED:      drafted
-    INTEGRATING  --> PLANNED:      planned
+    IMPLEMENTING --> DRAFTED
+    APPROVING    --> DRAFTED
+    APPROVING    --> PLANNED
+    INTEGRATING  --> DRAFTED
+    INTEGRATING  --> PLANNED
 
-    DRAFTED      --> CANCELLED:    cancelled
-    SHELVED      --> CANCELLED:    cancelled
-    PLANNED      --> CANCELLED:    cancelled
-    STALLED      --> CANCELLED:    cancelled
-    IMPLEMENTED  --> CANCELLED:    cancelled
-    DECLINED     --> CANCELLED:    cancelled
-    APPROVED     --> CANCELLED:    cancelled
-    DEFERRED     --> CANCELLED:    cancelled
+    DRAFTED      --> CANCELLED
+    SHELVED      --> CANCELLED
+    PLANNING     --> CANCELLED
+    PLANNED      --> CANCELLED
+    STALLED      --> CANCELLED
+    IMPLEMENTING --> CANCELLED
+    IMPLEMENTED  --> CANCELLED
+    DECLINED     --> CANCELLED
+    APPROVING    --> CANCELLED
+    APPROVED     --> CANCELLED
+    DEFERRED     --> CANCELLED
+    INTEGRATING  --> CANCELLED
 
     INTEGRATED   --> [*]
     CANCELLED    --> [*]
 ```
 
 ```txt
-                     ●
-                     │
-                     ▼     ┌────────────────────────────────────┐
-              ┌──────────────┐   shelved   ┌──────────────┐     │
-    ┌────────▶│   DRAFTED    │────────────▶│   SHELVED    │─────┤
-    │ drafted │              │◀────────────│              │     │
-    │         └──────────────┘   drafted   └──────────────┘     │
-    │       plan │       ▲                        ▲ shelved     │
-    │            ▼       │ drafted                │             │
-    │         ┏━━━━━━━━━━━━━━┓                    │             │
-    │         ┃   PLANNING   ┃────────────────────┘             │
-    │         ┗━━━━━━━━━━━━━━┛                                  │
-    │                │ planned                                  │
-    │                ▼     ┌────────────────────────────────────┤
-    │         ┌──────────────┐   stalled   ┌──────────────┐     │
-    ├────────▶│   PLANNED    │────────────▶│   STALLED    │─────┤
-    │ planned │              │◀────────────│              │     │
-    │         └──────────────┘   planned   └──────────────┘     │
-    │  implement │       ▲                        ▲ stalled     │
-    │            ▼       │ planned                │             │
-    │         ┏━━━━━━━━━━━━━━┓                    │             │
-    ├─────────┃ IMPLEMENTING ┃────────────────────┘             │
-    │         ┗━━━━━━━━━━━━━━┛                                  │
-    │                │ implemented                              │
-    │                ▼     ┌────────────────────────────────────┤
-    │         ┌──────────────┐  declined   ┌──────────────┐     │
-    │         │ IMPLEMENTED  │────────────▶│   DECLINED   │─────┤
-    │         │              │◀────────────│              │     │
-    │         └──────────────┘ implemented └──────────────┘     │
-    │    approve │       ▲                        ▲ declined    │
-    │            ▼       │ implemented            │             │
-    │         ┏━━━━━━━━━━━━━━┓                    │             │
-    ├─────────┃  APPROVING   ┃────────────────────┘             │
-    │         ┗━━━━━━━━━━━━━━┛                                  │
-    │                │ approved                                 │
-    │                ▼     ┌────────────────────────────────────┤
-    │         ┌──────────────┐  deferred   ┌──────────────┐     │
-    │         │   APPROVED   │────────────▶│   DEFERRED   │─────┤
-    │         │              │◀────────────│              │     │
-    │         └──────────────┘  approved   └──────────────┘     │
-    │  integrate │       ▲ approved               ▲ deferred    │
-    │            ▼       │                        │             │
-    │         ┏━━━━━━━━━━━━━━┓                    │             │
-    └─────────┃ INTEGRATING  ┃────────────────────┘             │
-              ┗━━━━━━━━━━━━━━┛                        cancelled │
-                     │ integrated                 ┌─────────────┘
-                     ▼                            ▼
-              ┌──────────────┐             ┌──────────────┐
-              │  INTEGRATED  │             │  CANCELLED   │
-              └──────────────┘             └──────────────┘
-                     │                            │
-                     └─────────────┬──────────────┘
-                                   │
-                                   ▼
-                                   ◉
+             ●
+             │
+             │     ┌──────────────────────────────┐
+             ▼     │                              │
+      ┌──────────────┐       ┌──────────────┐     │
+┌────▶│   DRAFTED    │──────▶│   SHELVED    │─────┤
+│     │              │◀──────│              │     │
+│     └──────────────┘       └──────────────┘     │
+│        │       ▲                  ▲             │
+│        ▼       │                  │             │
+│     ┏━━━━━━━━━━━━━━┓              │             │
+│     ┃   PLANNING   ┃──────────────┘             │
+│     ┃              ┃────────────────────────────┤
+│     ┗━━━━━━━━━━━━━━┛                            │
+│            │     ┌──────────────────────────────┤
+│            ▼     │                              │
+│     ┌──────────────┐       ┌──────────────┐     │
+├────▶│   PLANNED    │──────▶│   STALLED    │─────┤
+│     │              │◀──────│              │     │
+│     └──────────────┘       └──────────────┘     │
+│        │       ▲                  ▲             │
+│        ▼       │                  │             │
+│     ┏━━━━━━━━━━━━━━┓              │             │
+├─────┃ IMPLEMENTING ┃──────────────┘             │
+│     ┃              ┃────────────────────────────┤
+│     ┗━━━━━━━━━━━━━━┛                            │
+│            │     ┌──────────────────────────────┤
+│            ▼     │                              │
+│     ┌──────────────┐       ┌──────────────┐     │
+│     │ IMPLEMENTED  │──────▶│   DECLINED   │─────┤
+│     │              │◀──────│              │     │
+│     └──────────────┘       └──────────────┘     │
+│        │       ▲                  ▲             │
+│        ▼       │                  │             │
+│     ┏━━━━━━━━━━━━━━┓              │             │
+├─────┃  APPROVING   ┃──────────────┘             │
+│     ┃              ┃────────────────────────────┤
+│     ┗━━━━━━━━━━━━━━┛                            │
+│            │     ┌──────────────────────────────┤
+│            ▼     │                              │
+│     ┌──────────────┐       ┌──────────────┐     │
+│     │   APPROVED   │──────▶│   DEFERRED   │─────┤
+│     │              │◀──────│              │     │
+│     └──────────────┘       └──────────────┘     │
+│        │       ▲                  ▲             │
+│        ▼       │                  │             │
+│     ┏━━━━━━━━━━━━━━┓              │             │
+└─────┃ INTEGRATING  ┃──────────────┘             │
+      ┃              ┃────────────────────────────┤
+      ┗━━━━━━━━━━━━━━┛                            │
+             │                                    │
+             ▼                                    │
+      ┌──────────────┐       ┌──────────────┐     │
+      │  INTEGRATED  │       │  CANCELLED   │◀────┘
+      │              │       │              │
+      └──────────────┘       └──────────────┘
+             │                      │
+             ├──────────────────────┘
+             │
+             ▼
+             ◉
 ```
 
 The 4 "activity" states express:
 
